Revit 2027 API
BrowserOrganization.SortingParameterId Property
Note: This API is now obsolete.
 The Id of the parameter used to determine the sorting order of items in the browser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use the 'getSortingParameterIdPath' method instead.")]
public ElementId SortingParameterId { get; }
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use the 'getSortingParameterIdPath' method instead.")>
Public ReadOnly Property SortingParameterId As ElementId
	Get
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use the 'getSortingParameterIdPath' method instead.")]
property ElementId^ SortingParameterId {
	ElementId^ get ();
}
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a later version of Revit. We suggest you use the 'getSortingParameterIdPath' method instead.")>]
member SortingParameterId : ElementId with get
Property Value
ElementId
See Also
Reference
BrowserOrganization Class
Autodesk.Revit.DB Namespace